[[["e39c5996-828b-488b-8279-ff1985e3ec00",{"pageContent":"**1. Welcome to the Game of Life (IRL Server Boot-up)**\n\nWelcome, Player! You've spawned in the IRL (\"In Real Life\") server. It's a weird open-world survival/social sim hybrid with no pause button, random weather, and unpredictable NPCs (non-player characters — a.k.a. adults). Your job? Level up, stay safe, learn stuff, and try not to delete your save file.\n\nYou were probably spawned into a party with two high-level NPCs (your parents or guardians). Sometimes they’re your guides. Sometimes they glitch out. That's okay. Even veteran players don't know what they're doing half the time.\n\n---\n\n**2. Patch Notes: Parental Separation or Divorce**\n\n**Update v2.1.0 – Party Split Detected**\n- Main party has been restructured. Two lead NPCs have relocated to different zones.\n- Shared custody questline initiated. Fast-travel system now toggles between Parent Zone A and Parent Zone B.","metadata":{"source":"./public/Routside_Kids_News_Guide.txt","loc":{"lines":{"from":1,"to":13}}}}],["f6094a14-fb4f-4f9d-92db-ef740e97a895",{"pageContent":"This update might feel buggy. That’s normal. You might have questions like, “Why is this happening?” or “Did I cause this?”\n\nSpoiler: You didn’t. That bug’s not on you. The devs (your parents) just had some compatibility issues that couldn't be patched.\n\nNew quest branches:\n- Learning two different home base maps\n- Packing bags more often\n- Figuring out how both Parent NPCs feel (hint: they're trying too!)\n\n---\n\n**3. Server Split Detected: What Happens When Parents Move Apart**\n\nSometimes, one Parent NPC might move to a different region entirely. This can trigger a Long-Distance Travel mechanic.\n\nEffects:\n- Reduced local co-op time with one parent\n- Increased messaging, phone calls, and virtual hangouts\n- New buffs like \"Resilience\" and \"Adaptability\" begin to unlock\n\nIt’s okay to feel confused, sad, or even relieved. Those are normal status effects.\n\n---\n\n**4. Moving to a New Region (aka Changing Cities)**","metadata":{"source":"./public/Routside_Kids_News_Guide.txt","loc":{"lines":{"from":15,"to":39}}}}],["a8e47c28-2257-4f67-a947-afac9aa0e6aa",{"pageContent":"It’s okay to feel confused, sad, or even relieved. Those are normal status effects.\n\n---\n\n**4. Moving to a New Region (aka Changing Cities)**\n\n**Event Notice: Region Transfer Activated**\n- You and your party have moved to a new city zone. World map updated.\n\nPossible side effects:\n- Missing your old guild (friends)\n- Confusing new terrain (school, neighborhood, grocery store layouts)\n- NPCs in the new area may speak differently, dress differently, or act differently\n\nTips:\n- Scout the area and locate safe zones (libraries, cool parks, friendly NPCs)\n- Use your emote wheel (smiles, jokes, shared interests) to build connections\n\nYes, it’s a lot. But this quest can unlock some rare loot — new friendships, new experiences, and bonus XP in social adaptability.\n\n---\n\n**5. Global Events: Why the Whole Server is Weird Sometimes**\n\nSometimes there’s a global event affecting all players. Think pandemic, war coverage, or economic issues.","metadata":{"source":"./public/Routside_Kids_News_Guide.txt","loc":{"lines":{"from":35,"to":59}}}}],["e794e907-5c86-4b6f-b948-c8cbd92d5d1a",{"pageContent":"---\n\n**5. Global Events: Why the Whole Server is Weird Sometimes**\n\nSometimes there’s a global event affecting all players. Think pandemic, war coverage, or economic issues.\n\nThese usually appear in your HUD as:\n- Adults watching the news more than usual\n- YouTube suddenly full of serious videos\n- Everyone talking about something scary or confusing\n\nIt’s okay to ask: “What’s going on?”\n\nThink of these as unexpected server-wide events. You’re allowed to feel overwhelmed. You’re also allowed to take breaks from the news feed.\n\n---\n\n**6. Regional Events: News from Your Specific Area**\n\nEach region (your city, country, etc.) has its own weather, rules, and events.\n\nExamples:\n- Heat waves → Equip sunscreen and hydrate potions\n- Elections → Grown-up NPCs arguing more often\n- Protests → Streets might be blocked, lots of signs and chants","metadata":{"source":"./public/Routside_Kids_News_Guide.txt","loc":{"lines":{"from":55,"to":79}}}}],["bbe9d578-b42e-4e04-b0e7-131617e33353",{"pageContent":"Examples:\n- Heat waves → Equip sunscreen and hydrate potions\n- Elections → Grown-up NPCs arguing more often\n- Protests → Streets might be blocked, lots of signs and chants\n\nYou don’t need to understand everything right away. Just know you’re not expected to fix the world — just be kind, stay alert, and level up at your own pace.\n\n---\n\n**7. Family Illness – When NPCs Need Healing**\n\nSometimes, an NPC you care about gets hit with a status debuff — a sickness or medical condition.\n\nSymptoms:\n- They might rest more, visit healer zones (hospitals), or act more tired or quiet\n- Other NPCs around them might act more stressed or emotional\n\nYou can’t equip a fix-it spell, but your presence is a passive healing aura.\n\nBuffs you can equip:\n- Compassion\n- Patience\n- Humor (used carefully!)\n\n---\n\n**8. Why Adult NPCs Are Sometimes Glitchy (a.k.a. Stressed)**","metadata":{"source":"./public/Routside_Kids_News_Guide.txt","loc":{"lines":{"from":76,"to":102}}}}],["b3494652-2b1a-4e7b-9cb6-e5a31ec54066",{"pageContent":"Buffs you can equip:\n- Compassion\n- Patience\n- Humor (used carefully!)\n\n---\n\n**8. Why Adult NPCs Are Sometimes Glitchy (a.k.a. Stressed)**\n\nEver noticed your Parent NPCs suddenly freeze, sigh loudly, or say things like “I’m just tired”? That’s stress — a debuff caused by work, money quests, health meters, and too many side quests at once.\n\nYou didn’t cause it. But your hugs and patience often lower their stress bar.\n\nTips:\n- Don’t take NPC outbursts personally\n- Ask, “Are you okay?” — it’s a powerful voice command\n\n---\n\n**9. Climate Change – Weather Patch Out of Control**\n\n**Global Patch Alert: Environment Overload**\n- Increased wildfires, floods, weird temperatures\n- Melting ice zones\n- Ocean creatures acting strange\n\nThe devs (humans) pushed the game too hard. Now we all have to patch things up.\n\nGood news? Players your age are some of the most creative problem-solvers in the server.","metadata":{"source":"./public/Routside_Kids_News_Guide.txt","loc":{"lines":{"from":95,"to":123}}}}],["78f38e3d-ce60-4050-879d-d21790cdfee2",{"pageContent":"The devs (humans) pushed the game too hard. Now we all have to patch things up.\n\nGood news? Players your age are some of the most creative problem-solvers in the server.\n\nMini-quests:\n- Recycle items → lower local pollution\n- Use public transport → reduce emissions\n- Talk to your guild about the planet\n\n---\n\n**10. Understanding Emotions: Buffs, Debuffs, and Cooldowns**\n\nEmotions in this game work like combat status effects. You might suddenly get:\n- SAD (Slowed Agility Debuff)\n- ANGRY (Nukes logic stat for 3 minutes)\n- HAPPY (Random stat boost across the board)\n\nEmotions aren’t bugs — they’re features.\nLearn to spot them, name them, and give them time to cooldown. You’re not broken. You’re leveling up.\n\n---\n\n**11. When Your Friends Change Builds or Loadouts (Growing Up Stuff)**\n\nSome friends might suddenly equip:\n- Edgy gear\n- Quiet Mode\n- New interests or pronouns","metadata":{"source":"./public/Routside_Kids_News_Guide.txt","loc":{"lines":{"from":121,"to":149}}}}],["7dd7e99c-032f-4320-a37d-ce2b55539e56",{"pageContent":"---\n\n**11. When Your Friends Change Builds or Loadouts (Growing Up Stuff)**\n\nSome friends might suddenly equip:\n- Edgy gear\n- Quiet Mode\n- New interests or pronouns\n\nThis is part of their player evolution. You don’t have to match them — just don’t uninstall them. Be curious, not critical.\n\nFriendships level up or down. That’s normal.\n\n---\n\n**12. School Stress – Side Quests with Unexpected Boss Battles**\n\nSchool is like a dungeon crawl:\n- Random pop quizzes = surprise attacks\n- Group projects = chaotic party raids\n- Homework = fetch quests that feel way too long\n\nIt’s okay to ask for a walkthrough (tutors, teachers, or older players). No one solos this dungeon forever.\n\n---\n\n**13. How to Talk to NPCs (a.k.a. Parents, Teachers, Siblings)**\n\nUse the right dialogue options:\n- “Can I ask you something?” (opens trust menu)\n- “I’m feeling [emotion] right now.” (triggers empathy response)\n- “Can you explain that again?” (resets confusion meter)","metadata":{"source":"./public/Routside_Kids_News_Guide.txt","loc":{"lines":{"from":142,"to":173}}}}],["5160e225-151a-4fad-bf10-04fcafeab74c",{"pageContent":"Most NPCs aren’t mind-readers. You gotta use your voice.\n\n---\n\n**14. Coping Mechanics – How to Equip Chill Gear**\n\nTo recover from tough quests or emotional status effects, equip your personal Chill Gear:\n- Music\n- Art\n- Gaming\n- Journaling\n- Talking to guild members\n\nRest zones are important. You don’t always have to grind.\n\nAlso: It’s not weak to need a break. Real players know when to hit “rest at campfire.”\n\n---\n\n**15. Closing Thoughts – You’re the Main Character Too**\n\nLife on the IRL server is messy. There’s no official guidebook. Just lots of players trying their best.\n\nRemember:\n- Your feelings are valid\n- Your choices matter\n- You are not alone\n\nYou’re the main character in your story. The devs may be mysterious, but the game is still worth playing.\n\nKeep leveling up, Player. The world needs your build.\n\n---\n\n**Bonus Zone Unlocked: Tips for Younger Siblings**","metadata":{"source":"./public/Routside_Kids_News_Guide.txt","loc":{"lines":{"from":175,"to":209}}}}],["b012bfcc-821d-48ab-b8db-b1641e71f456",{"pageContent":"Keep leveling up, Player. The world needs your build.\n\n---\n\n**Bonus Zone Unlocked: Tips for Younger Siblings**\n\nIf you’ve got younger players in your party (siblings), they might look to you for help. You don’t have to be their guild leader — just a friendly co-op partner.\n\nWays to support:\n- Help them navigate new quests (like school, moving, or scary headlines)\n- Let them talk (even when they don’t make total sense)\n- Show them how you chill\n\nSometimes being the older sibling feels like an unwanted leadership role. But just being around and showing kindness is enough to unlock huge buffs for both of you.\n\nThanks for playing. And remember: Respawn is real. Hope is a feature, not a bug.","metadata":{"source":"./public/Routside_Kids_News_Guide.txt","loc":{"lines":{"from":205,"to":220}}}}]],{"0":"e39c5996-828b-488b-8279-ff1985e3ec00","1":"f6094a14-fb4f-4f9d-92db-ef740e97a895","2":"a8e47c28-2257-4f67-a947-afac9aa0e6aa","3":"e794e907-5c86-4b6f-b948-c8cbd92d5d1a","4":"bbe9d578-b42e-4e04-b0e7-131617e33353","5":"b3494652-2b1a-4e7b-9cb6-e5a31ec54066","6":"78f38e3d-ce60-4050-879d-d21790cdfee2","7":"7dd7e99c-032f-4320-a37d-ce2b55539e56","8":"5160e225-151a-4fad-bf10-04fcafeab74c","9":"b012bfcc-821d-48ab-b8db-b1641e71f456"}]